brew "bat"
brew "bottom"
brew "broot"
brew "cloc"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fontconfig"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gping"
brew "htop"
brew "jq"
brew "just"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "tmux"
brew "tokei"
brew "tree"
brew "typst"
brew "uv"
brew "vim"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# yazi and dependencies
brew "yazi"
brew "chafa"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "sevenzip"
brew "p7zip"
#brew "jq"
brew "poppler"
#brew "fd"
#brew "ripgrep"
#brew "fzf"
#brew "zoxide"
brew "imagemagick"
